[
  {
    "week": 1,
    "ranking": 1,
    "team": "Washington",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>It took a while, but the Huskies overcame a sluggish first half in which they led 10-7 at the break and overwhelmed Rutgers in the second half for a satisfying 30-14 nonconference road win. UW must shore up the running game, which gained just 84 yards and find alternate downfield receiving targets other than Dante Pettis.<p><strong>This week:</strong>&nbsp;Against Montana."
  },
  {
    "week": 1,
    "ranking": 2,
    "team": "USC",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The Trojans led 35-31 with 4:37 remaining before a pair of late touchdowns sealed a 49-31victory over Western Michigan at The Coliseum. The Trojans won’t stay unbeaten for long unless they fix a leaky run defense that allowed 263 yards. QB Sam Darnold tossed 2 INTs and failed to throw a touchdown in his first start, which put a chill on his Heisman Trophy campaign. <p><strong>This week:</strong>&nbsp; Against Stanford."
  },
  {
    "week": 1,
    "ranking": 3,
    "team": "Stanford",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>It’s easy to forget the Cardinal pounded Rice 62-7 in its opener because it was on August 27 and the game was played on the other side of the globe. But Stanford did have the most complete season debut in the conference. The defense nearly had a shutout, RB Bryce Love ran for 180 yards and QB Keller Chryst passed for 253. <p><strong>This week:</strong>&nbsp; At USC.\n "
  },
  {
    "week": 1,
    "ranking": 4,
    "team": "UCLA",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>This is probably a little too high for the Bruins, but did you see that incredible 45-44 win over Texas A&M? The Bruins trailed 44-10 late in the third quarter and had a 0.5 probability to win the game. It was the second largest comeback in NCAA history thanks in large part to QB Josh Rosen. However, can Rosen’s heroics continue to save a defense that allowed 382 yards rushing? <p><strong>This week:</strong>&nbspAgainst Hawaii."
  },
  {
    "week": 1,
    "ranking": 5,
    "team": "Washington State",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The long wait is over. Mike Leach finally won a season opener with the Cougars. And QB Luke Falk (33 of 39 for 311 yards, 3 TDs and 0 INT) looked terrific in an 31-0 victory against overmatched FCS opponent Montana State. WSU allowed just 28 passing yards, which is the fewest since 1996. <p><strong>This week:</strong>&nbsp Against Boise State."
  },
  {
    "week": 1,
    "ranking": 6,
    "team": "California",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>No one expects the Golden Bears to finish in the top half of the rankings at the end of the season. But then, no one gave them much of a chance to win 35-30 at North Carolina. Don’t tell new coach Justin Wilcox that this is a rebuilding year. The defense, which allowed 440 yards, still needs a lot of work. But if new QB Ross Bowers (363 yards, 4 TDs, 2 INTs) can cut down on the miscues, then maybe Cal can make it to a bowl game. <p><strong>This week:</strong>&nbsp Against Weber State."
  },
  {
    "week": 1,
    "ranking": 7,
    "team": "Colorado",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The Buffaloes defense was supposed to struggle after losing its coordinator Jim Leavitt to Oregon and needing to replace eight departing starters. But Colorado nearly shutout Colorado State in a 17-3 victory a week after the Rams rolled up 58 points on Oregon State. RB Phillip Lindsay (19 carries, 140 yards, 1 TD) is a gem. <p><strong>This week:</strong>&nbsp Against Texas State."
  },
  {
    "week": 1,
    "ranking": 8,
    "team": "Oregon",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The Willie Taggart era started with a bang – or more precisely a 100-yard kickoff return from Tony Brooks-James. The Ducks trounced Southern Utah 77-21 – the most points since 1916 – while piling up 703 yards. They scored 21 points in each of the first three quarters. RB Royce Freeman (23 carries, 150 yards, 4 TDs) and QB Justin Herbert (281 passing yards) looked incredible. But it was against Southern Utah. <p><strong>This week:</strong>&nbspAgainst Nebraska."
  },
  {
    "week": 1,
    "ranking": 9,
    "team": "Utah",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>It’s just one game – against an FCS opponent at that  – but maybe, just maybe the Utes have found a quarterback in Tyler Huntley. He completed 23 of 32 passes for 237 yards, 1 TD and 1 INT during a 37-16 victory. Keep in mind, Rosen had more yards in the fourth quarter alone. But this is Utah. And the Utes have been looking for a QB since Brian Johnson left in 2008. <p><strong>This week:</strong>&nbsp; At BYU."
  },
  {
    "week": 1,
    "ranking": 10,
    "team": "Arizona",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The Wildcats ran wild (506 yards) over Northern Arizona for a 62-24 victory. No real surprise there. But what about the passing game? QB Brandon Dawkins (7 for 13, 89 yards, 1 TD) doesn't look as if he’s progressed much as a passer. Another potential problem, the Cats allowed 377 passing yards. <p><strong>This week:</strong>&npsp Against Houston."
  },
  {
    "week": 1,
    "ranking": 11,
    "team": "Arizona State",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>Depth could be an issue for the Sun Devils, which used just 11 defensive players during the first half of their 37-31 win over New Mexico State. Coach Todd Graham: “When we've got guys we can rotate, we're going to rotate. Until they perform in practice, the 1s are going to play a lot of plays.\" Good luck with that. <p><strong>This week:</strong>&nbsp; Against San Diego State."
  },
  {
    "week": 1,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record:</strong>&nbsp;1-1<p>If the Beavers didn’t make a 17-yard FG with 1:08 left and Portland State hadn’t missed a game-tying boot as time expired, then OSU would be 0-2 and staring at a daunting schedule that includes three straight ranked Pac-12 opponents (WSU, UW, USC) when league play begins next week. The Beavers allowed 525 yards in opener to Colorado State and 515 to PSU. <p><strong>This week:</strong>&nbsp; Against Minnesota."
  },
  {
    "week": 2,
    "ranking": 1,
    "team": "USC",
    "blurb": "<strong>Record:</strong>&nbsp;2-0, 1-0<p>If not for penalties (8 for 90 yards), their 42-24 win over then-No. 14 Stanford would have been a bigger blowout. <p><strong>This week:</strong>&nbsp; Against Texas."
  },
  {
    "week": 2,
    "ranking": 2,
    "team": "Washington",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>Through no fault of their own, the Huskies slide out of the top spot.<p><strong>This week:</strong>&nbsp; Against Freno State."
  },
  {
    "week": 2,
    "ranking": 3,
    "team": "UCLA",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>For the second straight week, a phenomenal performance from QB Josh Rosen overcomes a shoddy defensive effort. <p><strong>This week:</strong>&nbsp; At Memphis."
  },
  {
    "week": 2,
    "ranking": 4,
    "team": "Stanford",
    "blurb": "<strong>Record:</strong>&nbsp;1-1, 0-1<p>Not sure if problem with passing game is QB Keller Chryst, completing 55.8 percent, or the receivers. <p><strong>This week:</strong>&nbsp; At San Diego State."
  },
  {
    "week": 2,
    "ranking": 5,
    "team": "Washington State",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>Comeback during a 47-44 3OT win over Boise State was epic but QB Luke Falk was benched. <p><strong>This week:</strong>&nbsp; Against Oregon State."
  },
  {
    "week": 2,
    "ranking": 6,
    "team": "Colorado",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>A retooled defense has not surrendered a TD this season and ranks second nationally in points allowed. <p><strong>This week:</strong>&nbsp; Against Northern Colorado."
  },
  {
    "week": 2,
    "ranking": 7,
    "team": "Oregon",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>If Ducks hadn’t allowed three late touchdowns in their 42-35 win over Nebraska, they might have returned to Top 25. <p><strong>This week:</strong>&nbsp; At Wyoming."
  },
  {
    "week": 2,
    "ranking": 8,
    "team": "Utah",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p> Tyler Huntley just might be a star in the making. The true freshman QB had 389 total yards in a 19-13 win at BYU. <p><strong>This week:</strong>&nbsp; Against San Jose State."
  },
  {
    "week": 2,
    "ranking": 9,
    "team": "California",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>It may have been an overreaction to put Cal sixth in the rankings last week after a 35-30 win at North Carolina. <p><strong>This week:</strong>&nbsp; Against Mississippi."
  },
  {
    "week": 2,
    "ranking": 10,
    "team": "Arizona",
    "blurb": "<strong>Record:</strong>&nbsp;1-1<p>Ran for 506 yards in a 62-24 win over Northern Arizona in opener, but held to 152 rushing yards in loss to Houston. <p><strong>This week:</strong>&nbsp; At UTEP."
  },
  {
    "week": 2,
    "ranking": 11,
    "team": "Arizona State",
    "blurb": "<strong>Record:</strong>&nbsp;1-1<p>The Sun Devils surrendered 216 yards to San Diego State RB Rashaad Penny during a 30-20 loss. <p><strong>This week:</strong>&nbsp; At Texas Tech."
  },
  {
    "week": 2,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record:</strong>&nbsp;1-2<p>The Beavers were shut out in the second half of their 48-14 loss to Minnesota.\n<p><strong>This week:</strong>&nbsp; At Washington State."
  },
  {
    "week": 3,
    "ranking": 1,
    "team": "USC",
    "blurb": "<strong>Record: 3-0, 1-1</strong><p>Somebody give Chase McGrath a scholarship. Like, right now. The freshman walk-on kicker booted a 31-yard field with time expiring to force overtime and then nailed a 43-yarder in the second overtime to give the Trojans a 27-24 win over Texas. Before the season, USC had what appeared to be the toughest first three games in the Pac-12. But their opponents (including Western Michigan and Stanford) are each 1-2.<p><strong>This week:</strong>&nbsp; At California"
  },
  {
    "week": 3,
    "ranking": 2,
    "team": "Washington",
    "blurb": "<strong>Record: 3-0 </strong><p>Surprisingly, Teamrankings.com ranks UW’s non-conference schedule 57th in the nation – stronger than Oregon State (60), Arizona (63), Oregon (78), Washington State (81), Colorado (82) and Utah (107). Collecting blowout wins like Saturday’s 48-16 victory over Fresno State should help the Huskies in the short term, but you get the feeling the absence of a signature out-of-conference performance will hurt them in CFP talks. FYI, the first CFP rankings is Oct. 31. <p><strong>This week:</strong>&nbsp:  At Colorado"
  },
  {
    "week": 3,
    "ranking": 3,
    "team": "Washington State",
    "blurb": "<strong>Record: 3-0, 1-0</strong><p>QB Luke Falk shook off last week’s benching and resumed his assault on the Pac-12 record books. He passed for 396 yards and 6 TDs in a 52-23 win over Oregon State. He has 98 TDs in his career, just 18 away from the conference record. Junior WR Tavares Martin Jr. had a monster day with 10 catches for 194 yards and 3 TDs. The Cougars improve to 3-0 for first time under coach Mike Leach, but losing senior LB Peyton Pelluer for the season with a broken foot put a downer on a big win.<p><strong>This week:</srong>&nbsp; Against Nevada"
  },
  {
    "week": 3,
    "ranking": 4,
    "team": "Colorado",
    "blurb": "<strong>Record: 3-0</strong><p>The Buffaloes gave up their first touchdown in a 41-21 win over Northern Colorado. CU allowed just three points in each of the previous two games. Sophomore QB Steven Montez had his best game of his career while accumulating 425 yards and tossed 4 TDs. <p><strong>This week;</srong>&nbsp: Against Washington"
  },
  {
    "week": 3,
    "ranking": 5,
    "team": "Oregon",
    "blurb": "<strong>Record: 3-0</strong><p>Feels as if not enough people are paying attention to the Ducks, even after their 49-13 win over Wyoming – their third game scoring at least 42 points. Sophomore QB Justin Herbert is looking like a NFL quarterback and there’s no doubt RB Royce Freeman will play on Sundays. The defense held highly-touted Wyoming QB Josh Allen to 9-for-24 passing and 64 yards, including an interception. <p><strong>This week:</srong>&nbsp; At Arizona State"
  },
  {
    "week": 3,
    "ranking": 6,
    "team": "Utah",
    "blurb": "<strong>Record: 3-0</strong><p>After throwing for 341 yards and four touchdowns in a 54-16 win over San Jose State, QB Tyler Huntley became the first Utah QB since Brian Johnson to have 300-yard passing games in back-to-back outings. WR Darren Carrington II, who transferred from Oregon, recorded his third straight 100-yard receiving game, finishing with 153 yards and 3 TDs. <p><strong>This week:</srong>&nbsp; Against Stanford"
  },
  {
    "week": 3,
    "ranking": 7,
    "team": "California",
    "blurb": "<strong>Record: 3-0</strong><p>Not sure whether to buy stock in the Golden Bears or not. But they’re undefeated heading into Pac-12 play after a 27-16 win over Mississippi. Cal has overcome second-half deficits in all three games and has outscored the opposition 57-13 after halftime. This time, the Golden Bears were down 16-7 at halftime before shutting out the Rebels in the second half. <p><strong>This week:</srong>&nbsp; Against USC"
  },
  {
    "week": 3,
    "ranking": 8,
    "team": "Stanford",
    "blurb": "<strong>Record: 1-2, 0-1</strong><p>The lights went out at Qualcomm Stadium, which briefly suspended the Cardinal’s 20-17 loss to San Diego State. But in truth, Stanford’s offense has suffered from a power outage all season. Stanford ranks 11th in the Pac-12 in offense and passing offense. Coach David Shaw may not want to admit it, but his team has issues at QB. <p><strong>This week:</srong>&nbsp; Against UCLA"
  },
  {
    "week": 3,
    "ranking": 9,
    "team": "UCLA",
    "blurb": "<strong>Record: 2-1 </strong><p> Can Josh Rosen play defense? That’s a joke, but not really. Not after the Bruins allowed 560 yards in a 48-45 loss at Memphis. Rosen tossed a pick-six in the third quarter, which was one of 2 INTs. But he also finished with 463 yards on 34-of-56 passing, 4 TDs and 2 INTs. He’s averaging 428 yards and 4 TDs this season. <p><strong>This week:</srong>&nbsp; At Stanford"
  },
  {
    "week": 3,
    "ranking": 10,
    "team": "Arizona",
    "blurb": "<strong>Record: 2-1</strong><p>For the second time this season, the Wildcats ran for more than 500 yards, which is fairly amazing in and of itself. But they ran roughshod over two winless teams - Northern Arizona in the opener, and in a win over UTEP last week. It remains to be seen if Arizona can continue its success in the run game against a formidable Pac-12 foe. Still, QB Brandon Dawkins was amazing last week while passing for 3 TDs and running for 3 TDs.<p><strong>This week:</srong>&nbsp; Against Utah"
  },
  {
    "week": 3,
    "ranking": 11,
    "team": "Arizona State",
    "blurb": "<strong>Record: 1-2</strong><p>The Sun Devils surrendered 543 passing yards and 6 TDs to QB Nic Shimonek during a 52-45 defeat that could be the start of a long losing streak, as coach Todd Graham's seat continues to get hotter. They likely won’t be favored in the next seven games. And four of their next five games are against ranked teams. <p><strong>This week:</strong>&nbsp; Against Oregon"
  },
  {
    "week": 3,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record: 1-3, 0-1</strong><p>The bad news: Not sure if the Beavers will win another game this season. And this was supposed to be the year they snapped a four-year bowl drought. The good news: QB Jake Luton has been discharged from the hospital after suffering what appeared to be a bad injury when he collided with WSU safety Jalen Thompson early in the fourth quarter. <p><strong>This week:</strong>&nbsp; bye"
  }
]