[
  {
    "week": 1,
    "ranking": 1,
    "team": "Washington",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>It took a while, but the Huskies overcame a sluggish first half in which they led 10-7 at the break and overwhelmed Rutgers in the second half for a satisfying 30-14 nonconference road win. UW must shore up the running game, which gained just 84 yards and find alternate downfield receiving targets other than Dante Pettis.<p><strong>This week:</strong>&nbsp;Against Montana."
  },
  {
    "week": 1,
    "ranking": 2,
    "team": "USC",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The Trojans led 35-31 with 4:37 remaining before a pair of late touchdowns sealed a 49-31victory over Western Michigan at The Coliseum. The Trojans won’t stay unbeaten for long unless they fix a leaky run defense that allowed 263 yards. QB Sam Darnold tossed 2 INTs and failed to throw a touchdown in his first start, which put a chill on his Heisman Trophy campaign. <p><strong>This week:</strong>&nbsp; Against Stanford."
  },
  {
    "week": 1,
    "ranking": 3,
    "team": "Stanford",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>It’s easy to forget the Cardinal pounded Rice 62-7 in its opener because it was on August 27 and the game was played on the other side of the globe. But Stanford did have the most complete season debut in the conference. The defense nearly had a shutout, RB Bryce Love ran for 180 yards and QB Keller Chryst passed for 253. <p><strong>This week:</strong>&nbsp; At USC.\n "
  },
  {
    "week": 1,
    "ranking": 4,
    "team": "UCLA",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>This is probably a little too high for the Bruins, but did you see that incredible 45-44 win over Texas A&M? The Bruins trailed 44-10 late in the third quarter and had a 0.5 probability to win the game. It was the second largest comeback in NCAA history thanks in large part to QB Josh Rosen. However, can Rosen’s heroics continue to save a defense that allowed 382 yards rushing? <p><strong>This week:</strong>&nbspAgainst Hawaii."
  },
  {
    "week": 1,
    "ranking": 5,
    "team": "Washington State",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The long wait is over. Mike Leach finally won a season opener with the Cougars. And QB Luke Falk (33 of 39 for 311 yards, 3 TDs and 0 INT) looked terrific in an 31-0 victory against overmatched FCS opponent Montana State. WSU allowed just 28 passing yards, which is the fewest since 1996. <p><strong>This week:</strong>&nbsp Against Boise State."
  },
  {
    "week": 1,
    "ranking": 6,
    "team": "California",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>No one expects the Golden Bears to finish in the top half of the rankings at the end of the season. But then, no one gave them much of a chance to win 35-30 at North Carolina. Don’t tell new coach Justin Wilcox that this is a rebuilding year. The defense, which allowed 440 yards, still needs a lot of work. But if new QB Ross Bowers (363 yards, 4 TDs, 2 INTs) can cut down on the miscues, then maybe Cal can make it to a bowl game. <p><strong>This week:</strong>&nbsp Against Weber State."
  },
  {
    "week": 1,
    "ranking": 7,
    "team": "Colorado",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The Buffaloes defense was supposed to struggle after losing its coordinator Jim Leavitt to Oregon and needing to replace eight departing starters. But Colorado nearly shutout Colorado State in a 17-3 victory a week after the Rams rolled up 58 points on Oregon State. RB Phillip Lindsay (19 carries, 140 yards, 1 TD) is a gem. <p><strong>This week:</strong>&nbsp Against Texas State."
  },
  {
    "week": 1,
    "ranking": 8,
    "team": "Oregon",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The Willie Taggart era started with a bang – or more precisely a 100-yard kickoff return from Tony Brooks-James. The Ducks trounced Southern Utah 77-21 – the most points since 1916 – while piling up 703 yards. They scored 21 points in each of the first three quarters. RB Royce Freeman (23 carries, 150 yards, 4 TDs) and QB Justin Herbert (281 passing yards) looked incredible. But it was against Southern Utah. <p><strong>This week:</strong>&nbspAgainst Nebraska."
  },
  {
    "week": 1,
    "ranking": 9,
    "team": "Utah",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>It’s just one game – against an FCS opponent at that  – but maybe, just maybe the Utes have found a quarterback in Tyler Huntley. He completed 23 of 32 passes for 237 yards, 1 TD and 1 INT during a 37-16 victory. Keep in mind, Rosen had more yards in the fourth quarter alone. But this is Utah. And the Utes have been looking for a QB since Brian Johnson left in 2008. <p><strong>This week:</strong>&nbsp; At BYU."
  },
  {
    "week": 1,
    "ranking": 10,
    "team": "Arizona",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>The Wildcats ran wild (506 yards) over Northern Arizona for a 62-24 victory. No real surprise there. But what about the passing game? QB Brandon Dawkins (7 for 13, 89 yards, 1 TD) doesn't look as if he’s progressed much as a passer. Another potential problem, the Cats allowed 377 passing yards. <p><strong>This week:</strong>&npsp Against Houston."
  },
  {
    "week": 1,
    "ranking": 11,
    "team": "Arizona State",
    "blurb": "<strong>Record:</strong>&nbsp;1-0<p>Depth could be an issue for the Sun Devils, which used just 11 defensive players during the first half of their 37-31 win over New Mexico State. Coach Todd Graham: “When we've got guys we can rotate, we're going to rotate. Until they perform in practice, the 1s are going to play a lot of plays.\" Good luck with that. <p><strong>This week:</strong>&nbsp; Against San Diego State."
  },
  {
    "week": 1,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record:</strong>&nbsp;1-1<p>If the Beavers didn’t make a 17-yard FG with 1:08 left and Portland State hadn’t missed a game-tying boot as time expired, then OSU would be 0-2 and staring at a daunting schedule that includes three straight ranked Pac-12 opponents (WSU, UW, USC) when league play begins next week. The Beavers allowed 525 yards in opener to Colorado State and 515 to PSU. <p><strong>This week:</strong>&nbsp; Against Minnesota."
  },
  {
    "week": 2,
    "ranking": 1,
    "team": "USC",
    "blurb": "<strong>Record:</strong>&nbsp;2-0, 1-0<p>If not for penalties (8 for 90 yards), their 42-24 win over then-No. 14 Stanford would have been a bigger blowout. <p><strong>This week:</strong>&nbsp; Against Texas."
  },
  {
    "week": 2,
    "ranking": 2,
    "team": "Washington",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>Through no fault of their own, the Huskies slide out of the top spot.<p><strong>This week:</strong>&nbsp; Against Freno State."
  },
  {
    "week": 2,
    "ranking": 3,
    "team": "UCLA",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>For the second straight week, a phenomenal performance from QB Josh Rosen overcomes a shoddy defensive effort. <p><strong>This week:</strong>&nbsp; At Memphis."
  },
  {
    "week": 2,
    "ranking": 4,
    "team": "Stanford",
    "blurb": "<strong>Record:</strong>&nbsp;1-1, 0-1<p>Not sure if problem with passing game is QB Keller Chryst, completing 55.8 percent, or the receivers. <p><strong>This week:</strong>&nbsp; At San Diego State."
  },
  {
    "week": 2,
    "ranking": 5,
    "team": "Washington State",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>Comeback during a 47-44 3OT win over Boise State was epic but QB Luke Falk was benched. <p><strong>This week:</strong>&nbsp; Against Oregon State."
  },
  {
    "week": 2,
    "ranking": 6,
    "team": "Colorado",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>A retooled defense has not surrendered a TD this season and ranks second nationally in points allowed. <p><strong>This week:</strong>&nbsp; Against Northern Colorado."
  },
  {
    "week": 2,
    "ranking": 7,
    "team": "Oregon",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>If Ducks hadn’t allowed three late touchdowns in their 42-35 win over Nebraska, they might have returned to Top 25. <p><strong>This week:</strong>&nbsp; At Wyoming."
  },
  {
    "week": 2,
    "ranking": 8,
    "team": "Utah",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p> Tyler Huntley just might be a star in the making. The true freshman QB had 389 total yards in a 19-13 win at BYU. <p><strong>This week:</strong>&nbsp; Against San Jose State."
  },
  {
    "week": 2,
    "ranking": 9,
    "team": "California",
    "blurb": "<strong>Record:</strong>&nbsp;2-0<p>It may have been an overreaction to put Cal sixth in the rankings last week after a 35-30 win at North Carolina. <p><strong>This week:</strong>&nbsp; Against Mississippi."
  },
  {
    "week": 2,
    "ranking": 10,
    "team": "Arizona",
    "blurb": "<strong>Record:</strong>&nbsp;1-1<p>Ran for 506 yards in a 62-24 win over Northern Arizona in opener, but held to 152 rushing yards in loss to Houston. <p><strong>This week:</strong>&nbsp; At UTEP."
  },
  {
    "week": 2,
    "ranking": 11,
    "team": "Arizona State",
    "blurb": "<strong>Record:</strong>&nbsp;1-1<p>The Sun Devils surrendered 216 yards to San Diego State RB Rashaad Penny during a 30-20 loss. <p><strong>This week:</strong>&nbsp; At Texas Tech."
  },
  {
    "week": 2,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record:</strong>&nbsp;1-2<p>The Beavers were shut out in the second half of their 48-14 loss to Minnesota.\n<p><strong>This week:</strong>&nbsp; At Washington State."
  },
  {
    "week": 3,
    "ranking": 1,
    "team": "USC",
    "blurb": "<strong>Record: 3-0, 1-1</strong><p>Somebody give Chase McGrath a scholarship. Like, right now. The freshman walk-on kicker booted a 31-yard field with time expiring to force overtime and then nailed a 43-yarder in the second overtime to give the Trojans a 27-24 win over Texas. Before the season, USC had what appeared to be the toughest first three games in the Pac-12. But their opponents (including Western Michigan and Stanford) are each 1-2.<p><strong>This week:</strong>&nbsp; At California"
  },
  {
    "week": 3,
    "ranking": 2,
    "team": "Washington",
    "blurb": "<strong>Record: 3-0 </strong><p>Surprisingly, Teamrankings.com ranks UW’s non-conference schedule 57th in the nation – stronger than Oregon State (60), Arizona (63), Oregon (78), Washington State (81), Colorado (82) and Utah (107). Collecting blowout wins like Saturday’s 48-16 victory over Fresno State should help the Huskies in the short term, but you get the feeling the absence of a signature out-of-conference performance will hurt them in CFP talks. FYI, the first CFP rankings is Oct. 31. <p><strong>This week:</strong>&nbsp:  At Colorado"
  },
  {
    "week": 3,
    "ranking": 3,
    "team": "Washington State",
    "blurb": "<strong>Record: 3-0, 1-0</strong><p>QB Luke Falk shook off last week’s benching and resumed his assault on the Pac-12 record books. He passed for 396 yards and 6 TDs in a 52-23 win over Oregon State. He has 98 TDs in his career, just 18 away from the conference record. Junior WR Tavares Martin Jr. had a monster day with 10 catches for 194 yards and 3 TDs. The Cougars improve to 3-0 for first time under coach Mike Leach, but losing senior LB Peyton Pelluer for the season with a broken foot put a downer on a big win.<p><strong>This week:</srong>&nbsp; Against Nevada"
  },
  {
    "week": 3,
    "ranking": 4,
    "team": "Colorado",
    "blurb": "<strong>Record: 3-0</strong><p>The Buffaloes gave up their first touchdown in a 41-21 win over Northern Colorado. CU allowed just three points in each of the previous two games. Sophomore QB Steven Montez had his best game of his career while accumulating 425 yards and tossed 4 TDs. <p><strong>This week;</srong>&nbsp: Against Washington"
  },
  {
    "week": 3,
    "ranking": 5,
    "team": "Oregon",
    "blurb": "<strong>Record: 3-0</strong><p>Feels as if not enough people are paying attention to the Ducks, even after their 49-13 win over Wyoming – their third game scoring at least 42 points. Sophomore QB Justin Herbert is looking like a NFL quarterback and there’s no doubt RB Royce Freeman will play on Sundays. The defense held highly-touted Wyoming QB Josh Allen to 9-for-24 passing and 64 yards, including an interception. <p><strong>This week:</srong>&nbsp; At Arizona State"
  },
  {
    "week": 3,
    "ranking": 6,
    "team": "Utah",
    "blurb": "<strong>Record: 3-0</strong><p>After throwing for 341 yards and four touchdowns in a 54-16 win over San Jose State, QB Tyler Huntley became the first Utah QB since Brian Johnson to have 300-yard passing games in back-to-back outings. WR Darren Carrington II, who transferred from Oregon, recorded his third straight 100-yard receiving game, finishing with 153 yards and 3 TDs. <p><strong>This week:</srong>&nbsp; Against Stanford"
  },
  {
    "week": 3,
    "ranking": 7,
    "team": "California",
    "blurb": "<strong>Record: 3-0</strong><p>Not sure whether to buy stock in the Golden Bears or not. But they’re undefeated heading into Pac-12 play after a 27-16 win over Mississippi. Cal has overcome second-half deficits in all three games and has outscored the opposition 57-13 after halftime. This time, the Golden Bears were down 16-7 at halftime before shutting out the Rebels in the second half. <p><strong>This week:</srong>&nbsp; Against USC"
  },
  {
    "week": 3,
    "ranking": 8,
    "team": "Stanford",
    "blurb": "<strong>Record: 1-2, 0-1</strong><p>The lights went out at Qualcomm Stadium, which briefly suspended the Cardinal’s 20-17 loss to San Diego State. But in truth, Stanford’s offense has suffered from a power outage all season. Stanford ranks 11th in the Pac-12 in offense and passing offense. Coach David Shaw may not want to admit it, but his team has issues at QB. <p><strong>This week:</srong>&nbsp; Against UCLA"
  },
  {
    "week": 3,
    "ranking": 9,
    "team": "UCLA",
    "blurb": "<strong>Record: 2-1 </strong><p> Can Josh Rosen play defense? That’s a joke, but not really. Not after the Bruins allowed 560 yards in a 48-45 loss at Memphis. Rosen tossed a pick-six in the third quarter, which was one of 2 INTs. But he also finished with 463 yards on 34-of-56 passing, 4 TDs and 2 INTs. He’s averaging 428 yards and 4 TDs this season. <p><strong>This week:</srong>&nbsp; At Stanford"
  },
  {
    "week": 3,
    "ranking": 10,
    "team": "Arizona",
    "blurb": "<strong>Record: 2-1</strong><p>For the second time this season, the Wildcats ran for more than 500 yards, which is fairly amazing in and of itself. But they ran roughshod over two winless teams - Northern Arizona in the opener, and in a win over UTEP last week. It remains to be seen if Arizona can continue its success in the run game against a formidable Pac-12 foe. Still, QB Brandon Dawkins was amazing last week while passing for 3 TDs and running for 3 TDs.<p><strong>This week:</srong>&nbsp; Against Utah"
  },
  {
    "week": 3,
    "ranking": 11,
    "team": "Arizona State",
    "blurb": "<strong>Record: 1-2</strong><p>The Sun Devils surrendered 543 passing yards and 6 TDs to QB Nic Shimonek during a 52-45 defeat that could be the start of a long losing streak, as coach Todd Graham's seat continues to get hotter. They likely won’t be favored in the next seven games. And four of their next five games are against ranked teams. <p><strong>This week:</strong>&nbsp; Against Oregon"
  },
  {
    "week": 3,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record: 1-3, 0-1</strong><p>The bad news: Not sure if the Beavers will win another game this season. And this was supposed to be the year they snapped a four-year bowl drought. The good news: QB Jake Luton has been discharged from the hospital after suffering what appeared to be a bad injury when he collided with WSU safety Jalen Thompson early in the fourth quarter. <p><strong>This week:</strong>&nbsp; bye"
  },
  {
    "week": 4,
    "ranking": 1,
    "team": "Washington",
    "blurb": "<strong>Record: 4-0, 1-0</strong><p>Apparently, the concern about the running game was overblown. Myles Gaskins had 152 yards in his first three games, but pounded Colorado for a career-high 202 in a 37-10 win at Colorado. UW's defense collected three interceptions and five sacks while moving to first in the Pac-12 in points allowed (11.8). Mounting injuries (Byron Murphy, Lavon Coleman, Chico McClatcher and Drew Sample) could be troublesome, though.<p><strong>This week:</strong>&nbsp; At Oregon State"
  },
  {
    "week": 4,
    "ranking": 2,
    "team": "USC",
    "blurb": "<strong>Record: 4-0, 2-0</strong><p>For the second straight week, the Trojans lived dangerously and had trouble putting away an overmatched opponent. This time, USC was tied 13-13 early in the fourth quarter at Cal before outscoring the Golden Bears 17-7 for a 30-20 victory. Without injured RB Ronald Jones II, QB Sam Darnold had to carry the offense and Cal held him in check. Last year, the Trojans were 1-3. They have since won 13 straight games, which is the team’s longest streak since former coach Pete Carroll won 34 straight a decade ago.<p><strong>This week:</strong>At Washington State"
  },
  {
    "week": 4,
    "ranking": 3,
    "team": "Washington State",
    "blurb": "<strong>Record: 4-0, 1-0</strong><p>QB Luke Falk put on a clinic while passing for 478 yards and 5 TDs in a 45-7 nonconference win over Nevada. At his current pace, Falk needs four games to break the Pac-12’s career record in passing yards and TDs. Falk and the Cougs will have a big test on Friday against USC, which has won its last five games in Pullman. <p><strong>This week:</strong>&nbsp; Against USC"
  },
  {
    "week": 4,
    "ranking": 4,
    "team": "Utah",
    "blurb": "<strong>Record: 4-0, 1-0</strong><p>Following an ugly 30-24 win at Arizona, the Utes head into the bye with two priorities: Get QB Tyler Huntley healthy and clean up the penalties. Huntley left last Saturday’s game in second quarter due to an injured shoulder, which forced the Utes to rely on five turnovers to secure the win. <p><strong>This week:</strong>&nbsp; bye"
  },
  {
    "week": 4,
    "ranking": 5,
    "team": "Stanford",
    "blurb": "<strong>Record: 2-2, 1-1</strong><p>The bad news: Not sure if the Beavers will win another game this season. And this was supposed to be the year they snapped a four-year bowl drought. The good news: QB Jake Luton has been discharged from the hospital after suffering what appeared to be a bad injury when he collided with WSU safety Jalen Thompson early in the fourth quarter. <p><strong>This week:</strong>&nbsp; Against Arizona State"
  },
  {
    "week": 4,
    "ranking": 6,
    "team": "California",
    "blurb": "<strong>Record: 3-1, 0-1</strong><p>The Golden Bears suffered their first loss, but new coach Justin Wilcox looks to have transformed a defense that ranked last in the Pac-12 and 127th in the country last year in points per game (42.6). If QB Ross Bowers hadn’t tossed 4 INTs and lost two fumbles against USC, then the Bears might still be undefeated.<p><strong>This week:</strong>&nbsp; At Oregon"
  },
  {
    "week": 4,
    "ranking": 7,
    "team": "Colorado",
    "blurb": "<strong>Record: 3-1, 0-1</strong><p>QB Steven Montez was exceptionally accurate on short passes against Washington when he completed 21 of 27 throws. But he made a costly error on a short throw that was intercepted and returned for a touchdown. Montez finished with just 171 yards and three interceptions, including a pick in the end zone on a long throw. He was also sacked four times. The reigning South division champion can’t afford another setback if it wants to keep pace with USC.<p><strong>This week:</strong>&nbsp; At UCLA"
  },
  {
    "week": 4,
    "ranking": 8,
    "team": "Arizona State",
    "blurb": "<strong>Record: 2-2, 1-0</strong><p>No one is going to forget the non-conferences losses to San Diego State and Texas Tech, but Saturday’s 37-35 upset win over then-No. 24 Oregon cooled the hot seat that coach Todd Graham has been sitting on. ASU was a 13-point underdog, but it led for most of the game and went up by 17 early in the third before trailing by a point in the final minutes.<p><strong>This week:</strong>&nbsp; At Stanford"
  },
  {
    "week": 4,
    "ranking": 9,
    "team": "Oregon",
    "blurb": "<strong>Record: 3-1, 0-1</strong><p>The Ducks are developing a reputation as an undisciplined team under first-year coach Willie Taggart. Oregon is the second-most penalized team in the country with 42. Only Troy (43) has more. Last Saturday, the Ducks were flagged 17 times – 3 were declined – for 99 yards.<p><strong>This week:</strong>&nbsp; Against Califo"
  },
  {
    "week": 4,
    "ranking": 10,
    "team": "Arizona",
    "blurb": "<strong>Record: 2-2, 0-1</strong><p>Don’t write off the Wildcats just yet. If they turn things around, it will be because of a revamped defense filled with first-year performers that’s been surprisingly stingy. Arizona ranks fifth in the Pac-12 allowing 22.2 points per game, down from 38.3 last season. The Wildcats have five takeaways – just five fewer than they had in 2016. And Arizona is limiting opponents to a 35.7 percent conversion rate on third down. <p><strong>This week:</strong>&nbsp; bye"
  },
  {
    "week": 4,
    "ranking": 11,
    "team": "UCLA",
    "blurb": "<strong>Record: 2-2, 0-1</strong><p>In the past 15 games against Power 5 schools, the Bruins are 4-11 with wins against Utah, Arizona, Oregon State and Texas A&M. And we remember Josh Rosen’s heroics in that unbelievable comeback win against the Aggies. He torched Stanford for 480 yards and 3 TDs last Saturday, but couldn’t overcome 2 INTs and a shoddy defense. <p><strong>This week:</strong>&nbsp; Against Colorado"
  },
  {
    "week": 4,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record: 1-3, 0-1</strong><p>QB Jake Luton won’t return any time soon after suffering a thoracic spine fracture two weeks ago. Backup Darell Garretson, who was 2-4 as a starter in 2016, takes over.  <p><strong>This week:</strong>&nbsp; Against Washington"
  },
  {
    "week": 5,
    "ranking": 1,
    "team": "Washington",
    "blurb": "<strong>Record: 5-0, 2-0</strong><p>Don’t expect UW to fall out of this spot any time soon. It’s somewhat concerning that AP voters didn’t reward No. 6 Huskies for a blowout 42-7 win over Oregon State and bumped No. 5 Georgia ahead of them.<p><strong>This week:</strong>&nbsp; Against California"
  },
  {
    "week": 5,
    "ranking": 2,
    "team": "Washington State",
    "blurb": "<strong>Record: 5-0, 2-0</strong><p>Best start since 2001 when Cougars began 7-0 and finished 10-2. WSU has the most impressive win in the Pac-12 (a 30-27 victory over then-No. 5 USC), which pushes it into the College Football Playoff conversation.<p><strong>This week:</strong>&nbsp; At Oregon"
  },
  {
    "week": 5,
    "ranking": 3,
    "team": "Utah",
    "blurb": "<strong>Record: 4-0, 1-0</strong><p>Pac-12’s stingiest rushing defense (87.0 yards per game) faces the nation’s leading rusher in Stanford’s Bryce Love, who averages 217.6 yards per game. After bye last week, Utes QB Tyler Huntley had extra time to recover from shoulder injury that knocked him out of Sept. 22 game. <p><strong>This week:</strong>&nbsp; Against Stanford"
  },
  {
    "week": 5,
    "ranking": 4,
    "team": "USC",
    "blurb": "<strong>Record: 4-1, 2-1</strong><p>QB Sam Darnold says his confidence is shaken. Injuries are mounting, including the loss of three starting offensive lineman. The Trojans don’t have a bye this season and must play 12 straight games, which is ridiculous. But they should be able to rest some starters on Saturday. <p><strong>This week:</strong>&nbsp; Against Oregon State"
  },
  {
    "week": 5,
    "ranking": 5,
    "team": "Stanford",
    "blurb": "<strong>Record: 3-2, 2-1</strong><p>Love (1,088 rushing yards) is on pace to break Barry Sanders’s single-season rushing mark of 2,628 yards. Love, who broke Stanford’s single-game rushing record with 301 in last week’s 34-24 win over Arizona State, is averaging an absurd 11.1 yards per carry and has a touchdown run of at least 50 yards in the past seven games. <p><strong>This week:</strong>&nbsp; At Utah"
  },
  {
    "week": 5,
    "ranking": 6,
    "team": "UCLA",
    "blurb": "<strong>Record: 3-2, 1-1</strong><p>Biggest jump in the rankings following a gritty 27-23 win over Colorado punctuated by a defensive stand in the final minutes. That’s right, the Bruins, which rank last in the Pac-12 in yards allowed, played a little defense when it counted. And QB Josh Rosen threw for 372 yards – his fifth straight game with at least 350.<p><strong>This week:</strong>&nbsp; Bye"
  },
  {
    "week": 5,
    "ranking": 7,
    "team": "Oregon",
    "blurb": "<strong>Record: 4-1, 1-1</strong><p>The Ducks are without QB Justin Herbert (collarbone) for next 4-6 weeks and backup quarterback Taylor Alie (concussion) was knocked out of last Saturday’s 45-24 win over Cal. Oregon may turn to true freshman Braxton Burmeister. It’s uncertain if RB Royce Freeman (shoulder) will be available Saturday. <p><strong>This week:</strong>&nbsp; Against Washington State"
  },
  {
    "week": 5,
    "ranking": 8,
    "team": "Colorado",
    "blurb": "<strong>Record: 3-2, 0-2</strong><p>Following second straight defeat, fell to bottom of Pac-12 South standings. The Buffaloes have a chance to jump back into the division race with winnable games against Arizona and Oregon State. <p><strong>This week:</strong>&nbsp; Against Arizona"
  },
  {
    "week": 5,
    "ranking": 9,
    "team": "California",
    "blurb": "<strong>Record: 3-2, 0-2</strong><p>The Golden Bears are hitting a little bit of adversity, but if they don’t fall apart the next two weeks there’s still a chance they could qualify for a bowl game. <p><strong>This week:</strong>&nbsp; At Washington"
  },
  {
    "week": 5,
    "ranking": 10,
    "team": "Arizona State",
    "blurb": "<strong>Record: 2-3, 1-1</strong><p>Good time for a bye considering the next three games are against ranked teams (UW, Utah and USC). Things could turn real ugly in a hurry for coach Todd Graham who probably needs a winning season to return next year.  <p><strong>This week:</strong>&nbsp; Bye"
  },
  {
    "week": 5,
    "ranking": 11,
    "team": "Arizona",
    "blurb": "<strong>Record: 2-2, 0-1</strong><p>My pick as the surprise team that’s going to make a run in the second half of the season. Not sure if the Wildcats will make it to a bowl game, but coach Rich Rodriguez is going to make things interesting.  <p><strong>This week:</strong>&nbsp; At Colorado"
  },
  {
    "week": 5,
    "ranking": 12,
    "team": "Oregon State",
    "blurb": "<strong>Record: 1-4, 0-2</strong><p>The Beavers will be hard pressed to win another game this season. Year 3 is an absolute mess for coach Gary Andersen, whose contract expires after 2021. Under Andersen, OSU is 7-22 overall, 3-17 in the Pac-12 and 0-13 on the road. <p><strong>This week:</strong>&nbsp; At USC"
  }
]